In [3]:
#strings Methods 
s = 'hello WORLD'
print(s.upper())

HELLO WORLD

In [4]:
print(s.lower())

hello world

In [5]:
print(s.swapcase())

HELLO world

### Strip()----->Removes white spaces

In [6]:
p = '***********hello world******'

In [7]:
print(p)
print(p.strip('*'))

***********hello world******
hello world

# Replace()

In [8]:
s = 'hello world i love java'
print(s)
print(s.replace('java','python'))

hello world i love java
hello world i love python

### Split,Join

In [9]:
first_name = 'Ram'
last_name = 'Ghimire'
print(first_name + ' ' + last_name)

Ram Ghimire

In [10]:
dates = '2022-01-05'
dates_split = dates.split('-')
dates_split

['2022', '01', '05']

In [11]:
print(dates_split[0])
print(dates_split[1])
print(dates_split[2])

2022
01
05

In [12]:
# gender: 'M'.'Male','MALE'

In [13]:
tid = [1,2,3,4,5]
dates = ['2022-01-05','2025-03-08','2023-05-08','2023-05-08','2023-05-10']
unit_price = [12,10,100,34,20]
quantity = [1,2,5,6,6]
full_name = ['ram ghimire','gopal poudel','hari pandey','suraj karki','Maya Sahi']

In [14]:
# quantity = [10, 20, 15, 30]  # example list, use your actual data
dicts = {
    'transaction_id': tid,
    'date_': dates,
    'unit_price': unit_price,
    'Quantity': quantity,
    'full_name': full_name
}

In [15]:
dicts

{'transaction_id': [1, 2, 3, 4, 5],
 'date_': ['2022-01-05',
  '2025-03-08',
  '2023-05-08',
  '2023-05-08',
  '2023-05-10'],
 'unit_price': [12, 10, 100, 34, 20],
 'Quantity': [1, 2, 5, 6, 6],
 'full_name': ['ram ghimire',
  'gopal poudel',
  'hari pandey',
  'suraj karki',
  'Maya Sahi']}

In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame(dicts)

In [18]:
df

   transaction_id       date_  unit_price  Quantity     full_name
0               1  2022-01-05          12         1   ram ghimire
1               2  2025-03-08          10         2  gopal poudel
2               3  2023-05-08         100         5   hari pandey
3               4  2023-05-08          34         6   suraj karki
4               5  2023-05-10          20         6     Maya Sahi

#### To seperate full_name as first name and last_name

In [19]:
df['full_name'].str

In [20]:
'ram ghimire'.split(' ')

['ram', 'ghimire']

In [21]:
'ram ghimire'.split(' ')[0]

'ram'

In [22]:
'ram ghimire'.split(' ')[1]

'ghimire'

##### To extract first_name

In [23]:
df['full_name'].str.split(' ').str.get(0)

0      ram
1    gopal
2     hari
3    suraj
4     Maya
Name: full_name, dtype: object

#### Creating a new column

In [24]:
df['first_name'] = df['full_name'].str.split(' ').str.get(0)

In [25]:
df

   transaction_id       date_  unit_price  Quantity     full_name first_name
0               1  2022-01-05          12         1   ram ghimire        ram
1               2  2025-03-08          10         2  gopal poudel      gopal
2               3  2023-05-08         100         5   hari pandey       hari
3               4  2023-05-08          34         6   suraj karki      suraj
4               5  2023-05-10          20         6     Maya Sahi       Maya

#### To add last name

In [26]:
df['full_name'].str.split(' ').str.get(1)

0    ghimire
1     poudel
2     pandey
3      karki
4       Sahi
Name: full_name, dtype: object

In [27]:
df['last_name'] = df['full_name'].str.split(' ').str.get(1)

In [28]:
df

,transaction_id,date_,unit_price,Quantity,full_name,first_name,last_name
0,1,2022-01-05,12,1,ram ghimire,ram,ghimire
1,2,2025-03-08,10,2,gopal poudel,gopal,poudel
2,3,2023-05-08,100,5,hari pandey,hari,pandey
3,4,2023-05-08,34,6,suraj karki,suraj,karki
4,5,2023-05-10,20,6,Maya Sahi,Maya,Sahi

#### Adding new column and calculating the total price

In [29]:
df['total_price']=df['unit_price']*df['Quantity']

In [30]:
df

,transaction_id,date_,unit_price,Quantity,full_name,first_name,last_name,total_price
0,1,2022-01-05,12,1,ram ghimire,ram,ghimire,12
1,2,2025-03-08,10,2,gopal poudel,gopal,poudel,20
2,3,2023-05-08,100,5,hari pandey,hari,pandey,500
3,4,2023-05-08,34,6,suraj karki,suraj,karki,204
4,5,2023-05-10,20,6,Maya Sahi,Maya,Sahi,120

## To keep cloumn in order.

In [31]:
df[['transaction_id','date_','unit_price','Quantity','full_name','first_name','last_name','total_price']]

,transaction_id,date_,unit_price,Quantity,full_name,first_name,last_name,total_price
0,1,2022-01-05,12,1,ram ghimire,ram,ghimire,12
1,2,2025-03-08,10,2,gopal poudel,gopal,poudel,20
2,3,2023-05-08,100,5,hari pandey,hari,pandey,500
3,4,2023-05-08,34,6,suraj karki,suraj,karki,204
4,5,2023-05-10,20,6,Maya Sahi,Maya,Sahi,120

### To convert the datatype of date

In [32]:
df['date_']

0    2022-01-05
1    2025-03-08
2    2023-05-08
3    2023-05-08
4    2023-05-10
Name: date_, dtype: object

In [33]:
pd.to_datetime(df['date_'])

0   2022-01-05
1   2025-03-08
2   2023-05-08
3   2023-05-08
4   2023-05-10
Name: date_, dtype: datetime64[ns]

In [34]:
df['date']=pd.to_datetime(df['date_']) ## Reassigning

In [35]:
df['date']

0   2022-01-05
1   2025-03-08
2   2023-05-08
3   2023-05-08
4   2023-05-10
Name: date, dtype: datetime64[ns]

### To extract date and months

In [36]:
df['date'].dt.year

0    2022
1    2025
2    2023
3    2023
4    2023
Name: date, dtype: int32

In [37]:
df['date'].dt.month

0    1
1    3
2    5
3    5
4    5
Name: date, dtype: int32

In [38]:
df['date'].dt.day

0     5
1     8
2     8
3     8
4    10
Name: date, dtype: int32

In [39]:
# df['month_numeric'] = df['date']
# df['day'] = df['date'].dt.day

### Doing quarter wise 
#### 12 months----> 12/4=3
##### jan,feb,March ---> 1st Quarter
##### April,May,June ---> 2nd  Quarter
##### .......

In [40]:
df['date'].dt.quarter

0    1
1    1
2    2
3    2
4    2
Name: date, dtype: int32

In [41]:
df['date'].dt.month_name()

0    January
1      March
2        May
3        May
4        May
Name: date, dtype: object

In [42]:
df['month_name'] = df['date'].dt.month_name()

#### To add quarter column with value will be added on exixting table

In [43]:
df['quarter']= df['date'].dt.quarter

In [44]:
df

,transaction_id,date_,unit_price,Quantity,full_name,first_name,last_name,total_price,date,month_name,quarter
0,1,2022-01-05,12,1,ram ghimire,ram,ghimire,12,2022-01-05,January,1
1,2,2025-03-08,10,2,gopal poudel,gopal,poudel,20,2025-03-08,March,1
2,3,2023-05-08,100,5,hari pandey,hari,pandey,500,2023-05-08,May,2
3,4,2023-05-08,34,6,suraj karki,suraj,karki,204,2023-05-08,May,2
4,5,2023-05-10,20,6,Maya Sahi,Maya,Sahi,120,2023-05-10,May,2

In [45]:
df['first_name'].str.upper()

0      RAM
1    GOPAL
2     HARI
3    SURAJ
4     MAYA
Name: first_name, dtype: object

In [46]:
df['first_name'].str.lower()

0      ram
1    gopal
2     hari
3    suraj
4     maya
Name: first_name, dtype: object

### REPLACE

In [47]:
df['first_name'].str.replace('ram','shayam')

0    shayam
1     gopal
2      hari
3     suraj
4      Maya
Name: first_name, dtype: object

#### Fetch the row whose first name starts with 's'

In [48]:
'hello'.startswith('i')       ## Example

False

In [49]:
'hello'.startswith('h')

True

In [50]:
df['first_name'].str.startswith('s')

0    False
1    False
2    False
3     True
4    False
Name: first_name, dtype: bool

### To extract table row whose  name starts with 's'

In [51]:
df[df['first_name'].str.startswith('s')]

,transaction_id,date_,unit_price,Quantity,full_name,first_name,last_name,total_price,date,month_name,quarter
3,4,2023-05-08,34,6,suraj karki,suraj,karki,204,2023-05-08,May,2